/*====================================================================
	プログラム全体に影響を与えるマクロ定義
=====================================================================*/

//デバッグ用マクロ
#define	DEBUG	0						//0-デバッグ無し
										//1-フレームレート表示,ゲームループエラー表示
										//2-VRAM空き容量表示
										//3-色の情報表示

//ウィンドウに関するマクロ
#define	WinXMax	640						//ウィンドウ幅
#define	WinYMax	480						//ウィンドウ高
#define	BPP		8						//BPP(フルスクリーン用)	

//DirextXオブジェクト解放
#define	RELEASE(x)		if((x)){(x)->Release();x=NULL;}
//オブジェクト解放(変数1個用)
#define	RELEASE_del(a)	if((a)){delete	(a);a=NULL;}
//オブジェクト解放(配列用)
#define	RELEASE_dels(b)	if((b)){delete	[](b);b=NULL;}